Revit 2024 API
ElevationMarker.CreateElevation Method
 Creates a new elevation ViewSection on the ElevationMarker at the desired index.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public ViewSection CreateElevation(
	Document document,
	ElementId viewPlanId,
	int index
)
Visual Basic
Public Function CreateElevation ( _
	document As Document, _
	viewPlanId As ElementId, _
	index As Integer _
) As ViewSection
Visual C++
public:
ViewSection^ CreateElevation(
	Document^ document,
	ElementId^ viewPlanId,
	int index
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document to which the new elevation ViewSection will be added.
viewPlanId
Type: Autodesk.Revit.DB.ElementId
 The id of a ViewPlan in which the ElevationMarker is visible. The new elevation ViewSection will derive its extents and inherit settings from the ViewPlan.
index
Type: System.Int32
 The index on the ElevationMarker where the new elevation ViewSection will be placed. The index on the ElevationMarker must be valid and unused. View direction is determined by the index.
Return Value
 The new elevation ViewSection.
Remarks
 The ViewFamilyType for the new elevation ViewSection is inherited from the ElevationMarker. The new elevation ViewSection will receive a unique view name.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The ElementId viewPlanId does not correspond to a ViewPlan. -or- index is occupied or out of range. -or- Elevation view creation is not allowed in this family.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  Only reference elevations can be hosted on this ElevationMarker.
Autodesk.Revit.Exceptions.ModificationForbiddenException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process.
Autodesk.Revit.Exceptions.ModificationOutsideTransactionException |  The document has no open transaction.
See Also
ElevationMarker Class
Autodesk.Revit.DB Namespace